# coding:utf-8
a0 = '戊辰辛酉壬申癸卯' + '甲子' + '丙申'#吴昊
#a0= '丙戌丙寅丁亥辛亥' + '己巳' + '丙申'  # 褚旭
a1 = '=======,'*3 + '@@@@@@@,'*2 + '=======,'*6
a2 = '流月,流年,时,日,月,年,,年,月,日,时,流年,流月'

b1 = {'癸':0,'甲':1,'乙':2,'丙':3,'丁':4,'戊':5,'己':6,'庚':7,'辛':8,'壬':9}
b2 = {'亥':0,'子':1,'丑':2,'寅':3,'卯':4,'辰':5,'巳':6,'午':6,'未':7,'申':9,'酉':10,'戌':11}
b3 = {
'甲':'印比劫食伤才财杀官卪',
'乙':'卪劫比伤食财才官杀印',
'丙':'官卪印比劫食伤才财杀',
'丁':'杀印卪劫比伤食财才官',
'戊':'财杀官卪印比劫食伤才',
'己':'才官杀印卪劫比伤食财',
'庚':'伤才财杀官卪印比劫食',
'辛':'食财才官杀印卪劫比伤',
'壬':'劫食伤才财杀官卪印比',
'癸':'比伤食财才官杀印卪劫',
}

b4 = {
'子': '癸',#阴水
'丑': '己',#阴土
'寅': '壬',#阳木
'卯': '乙',#阴木
'辰': '戊',#阳土
'巳': '丙',#阳火
'午': '丁',#阴火
'未': '己',#阴土
'申': '庚',#阳金
'酉': '辛',#阴金
'戌': '戊',#阳土
'亥': '壬',#阳水
}

b5 = {
'子': '癸',
'丑': '己癸辛',
'寅': '甲丙戊',
'卯': '乙',
'辰': '戊乙癸',
'巳': '丙戊庚',
'午': '丁己',
'未': '己乙丁',
'申': '庚戊壬',
'酉': '辛',
'戌': '戊辛丁',
'亥': '壬甲',
}

b6 = {
    '甲己': '甲己 土中正之合',
    '乙庚': '乙庚 金仁义之合',
    '丙辛': '丙辛 水威制之合',
    '丁壬': '丁壬 木淫匿之合',
    '戊癸': '戊癸 火无情之合',

    '寅卯辰': '寅卯辰 三会木',
    '巳午未': '巳午未 三会火',
    '申酉戌': '申酉戌 三会金',
    '亥子丑': '亥子丑 三会水',

    '寅午戌': '寅午戌 三合火',
    '巳酉丑': '巳酉丑 三合金',
    '申子辰': '申子辰 三合水',
    '亥卯未': '亥卯未 三合木',

    '寅午': '寅午 半三合火',
    '寅戌': '寅戌 拱局',
    '巳酉': '巳酉 半三合金',
    '午戌': '午戌 半三合火',
    '酉丑': '酉丑 半三合金',
    '申子': '申子 半三合水',
    '卯未': '卯未 半三合木',
    '子辰': '子辰 半三合水',
    '亥卯': '亥卯 半三合木',

    '子丑': '子丑 六合土',
    '寅亥': '寅亥 六合木',
    '卯戌': '卯戌 六合火',
    '辰酉': '辰酉 六合金',
    '午未': '午未 六合火',
    '巳酉': '巳酉 六合水',

    '寅丑': '寅丑 支藏人元',
    '卯申': '卯申 支藏人元',
    '午亥': '午亥 支藏人元',

    '子午': '子午 六冲',
    '丑未': '丑未 六冲',
    '寅申': '寅申 六冲',
    '卯酉': '卯酉 六冲',
    '辰戌': '辰戌 六冲',
    '巳亥': '巳亥 六冲',

    '子未': '子未 六害',
    '丑午': '丑午 六害',
    '寅巳': '寅巳 六害',
    '卯辰': '卯辰 六害',
    '酉戌': '酉戌 六害',
    '申亥': '申亥 六害',

    '子酉': '子酉 破职能部门不为你服务',
    '卯午': '卯午 破职能部门不为你服务',
    '辰丑': '辰丑 破同行内部矛盾',
    '未戌': '未戌 破同行内部矛盾',
    '寅亥': '寅亥 破隐蔽的小矛盾',
    '巳申': '巳申 破隐蔽的小矛盾',

    #'辰辰': '辰辰 自刑',
    #'午午': '午午 自刑',
    #'酉酉': '酉酉 自刑',
    #'亥亥': '亥亥 自刑',
    '子卯': '子卯 相刑',
    '寅巳申': '寅巳申 相刑',
    '丑未戌': '丑未戌相刑',
}
b7 = {
'甲':'123\n',
'壬':'123\n',
'丁':'123\n',
}
b8 = {
'甲':'沐冠禄旺衰病死墓绝胎养生',
'乙':'病衰旺禄冠墓生养胎绝墓死',
'丙':'养生沐冠禄旺衰病死墓绝胎',
'丁':'墓死病衰旺禄冠墓生养胎绝',
'戊':'绝胎养生沐冠禄旺衰病死墓',
'己':'胎绝墓死病衰旺禄冠墓生养',
'庚':'死墓绝胎养生沐冠禄旺衰病',
'辛':'生养胎绝墓死病衰旺禄冠墓',
'壬':'衰病死墓绝胎养生沐冠禄旺',
'癸':'冠墓生养胎绝墓死病衰旺禄',
}
vert0 = lambda s: [s[i:i + 3] for i in range(len(s)) if i % 3 == 0]
vert1 = lambda s: [s[i:i + 3] for i in range(len(s)) if i % 6 == 0]
vert2 = lambda s: [s[i:i + 3] for i in range(len(s)) if (i+3) % 6 == 0]
a3 = vert1(a0)
a4 = vert2(a0)

a5 = vert0(b3[a3[2]])[b1[a3[5]]] + ',' + vert0(b3[a3[2]])[b1[a3[4]]] + ',' + vert0(b3[a3[2]])[b1[a3[3]]]+ ',' + ''+ ',' + vert0(b3[a3[2]])[b1[a3[1]]]+ ',' + vert0(b3[a3[2]])[b1[a3[0]]]+ ',' + ''+ ',' + ''+ ',' + ''+ ',' + ''+ ',' + ''+ ',' + ''+ ',' + ''
def four(sstring):
    msg = ''
    for u in b6:
        if set(vert0(u))<=set(vert0(sstring)):
            if vert0(sstring)[-1] in vert0(u) and vert0(sstring)[0] in vert0(u):
                msg = msg + b6[u] + ' '
    return msg.rstrip(',')
def five(sstring):
    msg = ''
    for u in vert0(sstring):
        msg = msg + vert0(b3[a3[2]])[b1[u]]
    return msg.rstrip(',')
a7 = '' + ',' + '' + ',' + '' + ',' + '' + ',' + '' + ',' + five(b5[a4[0]]) + ',' + b5[a4[0]] + ',' + '====' + ',' + four(a4[0]+a4[1]) + ',' + four(a4[0]+a4[1]+a4[2])+ ',' + four(a4[0]+a4[1]+a4[2]+a4[3]) + ',' + four(a4[0]+a4[1]+a4[2]+a4[3]+a4[4]) + ',' + four(a4[0]+a4[1]+a4[2]+a4[3]+a4[4]+a4[5])
a8 = '' + ',' + '' + ',' + '' + ',' + '' + ',' + five(b5[a4[1]]) + ',' + '' + ',' + b5[a4[1]] + ',' + '' + ',' + '====' + ',' + four(a4[1]+a4[2])+ ',' + four(a4[1]+a4[2]+a4[3]) + ',' + four(a4[1]+a4[2]+a4[3]+a4[4]) + ',' + four(a4[1]+a4[2]+a4[3]+a4[4]+a4[5])
a9 = '' + ',' + '' + ',' + '' + ',' + five(b5[a4[2]]) + ',' + '' + ',' + '' + ',' + b5[a4[2]] + ',' + '' + ',' + '' + ',' + '===='+ ',' + four(a4[2]+a4[3]) + ',' + four(a4[2]+a4[3]+a4[4]) + ',' + four(a4[2]+a4[3]+a4[4]+a4[5])
aa = '' + ',' + '' + ',' + five(b5[a4[3]]) + ',' + '' + ',' + '' + ',' + '' + ',' + b5[a4[3]] + ',' + '' + ',' + '' + ',' + ''+ ',' + '====' + ',' + four(a4[3]+a4[4]) + ',' + four(a4[3]+a4[4]+a4[5])
ab = '' + ',' + five(b5[a4[4]]) + ',' + '' + ',' + '' + ',' + '' + ',' + '' + ',' + b5[a4[4]] + ',' + '' + ',' + '' + ',' + ''+ ',' + '' + ',' + '*****' + ',' + four(a4[4]+a4[5])
ac = five(b5[a4[5]]) + ',' + '' + ',' + '' + ',' + '' + ',' + '' + ',' + '' + ',' + b5[a4[5]] + ',' + '' + ',' + '' + ',' + ''+ ',' + '' + ',' + '' + ',' + '*****'
ad = b7[a3[2]]
ae = vert0(b8[a3[2]])[b2[a4[5]]] + ',' + vert0(b8[a3[2]])[b2[a4[4]]] + ','+ vert0(b8[a3[2]])[b2[a4[3]]] + ','+vert0(b8[a3[2]])[b2[a4[2]]] +','+ vert0(b8[a3[2]])[b2[a4[1]]] +','+ vert0(b8[a3[2]])[b2[a4[0]]]
af = five(b5[a4[5]]) + ',' + five(b5[a4[4]]) + ',' + five(b5[a4[3]]) + ',' + five(b5[a4[2]]) + ',' + five(b5[a4[1]]) + ',' + five(b5[a4[0]])

fp = open('1.csv','w')

#fp.write(','.join(a4[::-1])+'\n')
c1 = ','*3 + '*****,'*2 + ','*6
fp.write(c1+'\n')
c2 = '流月,流年,时,日,月,年,'


fp.write(c2+'\n')
fp.write(ae+'\n')
fp.write(a5+'\n')
fp.write(af+'\n')
fp.write(','.join(a3[::-1]) + '\n')
fp.write(','.join(a4[::-1]) + '\n')
fp.write(',,,,,,,,,,,,,,' + '\n')
fp.write(',,,,,====,' + b5[a4[0]] + '\n')
fp.write(',,,,====,' +four(a4[0]+a4[1])+',' +b5[a4[1]] + '\n')
fp.write(',,,====,' +four(a4[1]+a4[2])+','+ four(a4[0]+a4[1]+a4[2])+','+b5[a4[2]] + '\n')
fp.write(',,====,' +four(a4[2]+a4[3])+','+ four(a4[1]+a4[2]+a4[3])+','+ four(a4[0]+a4[1]+a4[2]+a4[3]) + ',' + b5[a4[3]] + '\n')
fp.write(',====,' +four(a4[3]+a4[4])+','+ four(a4[2]+a4[3]+a4[4])+','+ four(a4[1]+a4[2]+a4[3]+a4[4])+','+ four(a4[0]+a4[1]+a4[2]+a4[3]+a4[4]) + ',' + b5[a4[4]] + '\n')
fp.write('====,' +four(a4[4]+a4[5])+','+ four(a4[3]+a4[4]+a4[5])+','+ four(a4[2]+a4[3]+a4[4]+a4[5])+','+ four(a4[1]+a4[2]+a4[3]+a4[4]+a4[5])+ ','+ four(a4[0]+a4[1]+a4[2]+a4[3]+a4[4]+a4[5]) + ',' + b5[a4[4]] + '\n')

fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')
fp.write('\n')


fp.close()
print 'end'
